#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-CAvpSurdDu5F5zH9

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.security_demo.aws_api_gateway_rest_api.api: Refreshing state... [id=e3vh22gyhl]
module.endpoint_01.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
module.security_demo.aws_api_gateway_api_key.api_key: Refreshing state... [id=vo9krzvmif]
module.security_demo.aws_api_gateway_deployment.deployment: Refreshing state... [id=jtgcfv]
module.endpoint_01.aws_api_gateway_resource.resource: Refreshing state... [id=jdhc55]
module.security_demo.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-08263f8zuc-OPTIONS]
module.endpoint_01.aws_api_gateway_model.model: Refreshing state... [id=qwfsgs]
module.security_demo.aws_api_gateway_request_validator.validator: Refreshing state... [id=h6gjmy]
module.security_demo.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-08263f8zuc-OPTIONS]
module.security_demo.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=3d32b9d4-53a4-431a-b6af-53ae33d291dd]
module.security_demo.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.endpoint_01.aws_api_gateway_method.method: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-POST]
module.security_demo.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=9zgd89]
module.endpoint_01.aws_api_gateway_integration.options: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-OPTIONS]
module.endpoint_01.aws_api_gateway_method.options: Refreshing state... [id=agm-e3vh22gyhl-jdhc55-OPTIONS]
module.security_demo.aws_api_gateway_method_settings.all: Refreshing state... [id=e3vh22gyhl-test-*/*]
module.security_demo.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-08263f8zuc-OPTIONS-200]
module.endpoint_01.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-POST-200]
module.endpoint_01.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-e3vh22gyhl-jdhc55-OPTIONS-200]
module.endpoint_01.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-e3vh22gyhl-jdhc55-OPTIONS-200]
module.security_demo.aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=vo9krzvmif]
module.endpoint_01.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
module.endpoint_01.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.endpoint_01.aws_api_gateway_integration.integration: Refreshing state... [id=agi-e3vh22gyhl-jdhc55-POST]
module.security_demo.aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/3d32b9d4-53a4-431a-b6af-53ae33d291dd,arn:aws:apigateway:us-east-1::/restapis/e3vh22gyhl/stages/test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ansible.aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "ansible"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # module.ansible.aws_ecs_task_definition.task will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential = true
                  + image     = "531133914787.dkr.ecr.us-east-1.amazonaws.com/packer-test:ansible"
                  + name      = "ansible"
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "ansible"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ansible.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecution"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ]
      + max_session_duration  = 3600
      + name                  = "ansible_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ansible_task = (known after apply)

```

</details>

*Pusher: @fer1035, Action: `pull_request`*